**Import Pandas and Numpy**

In [1]:
import numpy as np
import pandas as pd

**Create fake data**

In [2]:
df = pd.DataFrame(np.random.randn(5,4),'a b c d e'.split(),'col1 col2 col3 col4'.split())
df

       col1      col2      col3      col4
a -2.097874 -1.440918  1.391710  1.001970
b -0.986892 -0.156239  1.026131  0.742117
c -0.392326 -0.330674 -0.216958 -0.254543
d  0.143269  1.214423 -0.242277 -0.453018
e  0.589433  1.740834 -0.526136 -1.462199

**Select single column, multiple columns , rows , iloc**

In [3]:
df['col1']

a   -2.097874
b   -0.986892
c   -0.392326
d    0.143269
e    0.589433
Name: col1, dtype: float64

In [4]:
df.loc['c']

col1   -0.392326
col2   -0.330674
col3   -0.216958
col4   -0.254543
Name: c, dtype: float64

In [5]:
df[['col1','col3']]

       col1      col3
a -2.097874  1.391710
b -0.986892  1.026131
c -0.392326 -0.216958
d  0.143269 -0.242277
e  0.589433 -0.526136

In [6]:
df.iloc[3]

col1    0.143269
col2    1.214423
col3   -0.242277
col4   -0.453018
Name: d, dtype: float64

**Make new column, drop column**

In [7]:
df['new'] = df['col2'] + df['col3']
df

       col1      col2      col3      col4       new
a -2.097874 -1.440918  1.391710  1.001970 -0.049208
b -0.986892 -0.156239  1.026131  0.742117  0.869893
c -0.392326 -0.330674 -0.216958 -0.254543 -0.547632
d  0.143269  1.214423 -0.242277 -0.453018  0.972146
e  0.589433  1.740834 -0.526136 -1.462199  1.214698

In [8]:
df.drop('new',axis=1)

       col1      col2      col3      col4
a -2.097874 -1.440918  1.391710  1.001970
b -0.986892 -0.156239  1.026131  0.742117
c -0.392326 -0.330674 -0.216958 -0.254543
d  0.143269  1.214423 -0.242277 -0.453018
e  0.589433  1.740834 -0.526136 -1.462199

In [9]:
df

       col1      col2      col3      col4       new
a -2.097874 -1.440918  1.391710  1.001970 -0.049208
b -0.986892 -0.156239  1.026131  0.742117  0.869893
c -0.392326 -0.330674 -0.216958 -0.254543 -0.547632
d  0.143269  1.214423 -0.242277 -0.453018  0.972146
e  0.589433  1.740834 -0.526136 -1.462199  1.214698

In [10]:
df.drop('new',axis=1,inplace=True)

In [11]:
df

       col1      col2      col3      col4
a -2.097874 -1.440918  1.391710  1.001970
b -0.986892 -0.156239  1.026131  0.742117
c -0.392326 -0.330674 -0.216958 -0.254543
d  0.143269  1.214423 -0.242277 -0.453018
e  0.589433  1.740834 -0.526136 -1.462199

**Select specific subsets, conditional select**

In [12]:
df.loc[['a','b'],['col1','col2']]

       col1      col2
a -2.097874 -1.440918
b -0.986892 -0.156239

In [13]:
df>1

    col1   col2   col3   col4
a  False  False   True   True
b  False  False   True  False
c  False  False  False  False
d  False   True  False  False
e  False   True  False  False

In [14]:
df[df>0]

       col1      col2      col3      col4
a       NaN       NaN  1.391710  1.001970
b       NaN       NaN  1.026131  0.742117
c       NaN       NaN       NaN       NaN
d  0.143269  1.214423       NaN       NaN
e  0.589433  1.740834       NaN       NaN

In [15]:
df[(df['col1']>0) & (df['col2']<0)]

Empty DataFrame
Columns: [col1, col2, col3, col4]
Index: []

In [16]:
df[(df['col1']>0) & (df['col2']<0)][['col1','col3']]

Empty DataFrame
Columns: [col1, col3]
Index: []